app/controllers/general_shopping_list_controller.rb

  def index
    @food_amount = 0
    @total_price = 0
    @recipe_foods = []
    @recipes = current_user.recipes

    @recipes.includes(:recipe_foods).each do |recipe|
      @food_amount += recipe.recipe_foods.count
      @recipe_foods << recipe.recipe_foods
      recipe.recipe_foods.includes(:food).each do |recipe_food|
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]