app/controllers/recipe_foods_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recipe_foods" ("created_at", "updated_at", "food_id", "recipe_id", "quantity") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-08-06 17:29:35.093908"], ["updated_at", "2022-08-06 17:29:35.093908"], ["food_id", 1], ["recipe_id", 1], ["quantity", 9]]
---
  def create
    recipe = Recipe.find(params[:recipe_id])
    if recipe.user == current_user
      new_recipe_food = RecipeFood.new(recipe_food_params)
      new_recipe_food.recipe = recipe
      if new_recipe_food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @recipe_food = RecipeFood.includes(:recipe).find(params[:id])