app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]
---
  def public_recipes
    @recipes = Recipe.includes(:user).where(public: true)

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @recipe = Recipe.includes(:foods).find(params[:id])

INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "description", "public", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user = current_user
    if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
---
  def my_recipes
    @recipes = Recipe.where(user_id: current_user.id)